In [1]:
# Import the required library

import io
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from scipy.stats import shapiro
from scipy import stats
import scipy
from statsmodels.formula.api import ols
from statsmodels.stats.anova import anova_lm
from statsmodels.stats.multicomp import pairwise_tukeyhsd
from google.colab import files

/usr/local/lib/python3.7/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
# file upload
uploaded = files.upload()

Saving 2019.xlsx to 2019.xlsx
Saving 2020.xlsx to 2020.xlsx
Saving 2021.xlsx to 2021.xlsx

In [3]:
df1=pd.read_excel(io.BytesIO(uploaded['2021.xlsx']))
df2=pd.read_excel(io.BytesIO(uploaded['2020.xlsx']))
df3=pd.read_excel(io.BytesIO(uploaded['2019.xlsx']))

In [4]:
# dataframe information check 

print(df1.info())
print('\n',df1.dtypes,'\n')
df1.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 252 entries, 0 to 251
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    252 non-null    int64
 1   month   252 non-null    int64
 2   vessel  252 non-null    object
 3   FT      252 non-null    object
 4   class   252 non-null    object
 5   value   252 non-null    int64
dtypes: int64(3), object(3)
memory usage: 11.9+ KB
None

 year       int64
month      int64
vessel    object
FT        object
class     object
value      int64
dtype: object

   year  month vessel     FT class  value
0  2021      1      계  10 FT     적      0
1  2021      1      계  10 FT     공      0
2  2021      1      계  10 FT     계      0

In [5]:
# dataframe information check 

print(df2.info())
print('\n',df2.dtypes,'\n')
df2.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 432 entries, 0 to 431
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    432 non-null    int64
 1   month   432 non-null    int64
 2   vessel  432 non-null    object
 3   FT      432 non-null    object
 4   class   432 non-null    object
 5   value   432 non-null    int64
dtypes: int64(3), object(3)
memory usage: 20.4+ KB
None

 year       int64
month      int64
vessel    object
FT        object
class     object
value      int64
dtype: object

   year  month vessel     FT class  value
0  2020      1      계  10 FT     적      0
1  2020      1      계  10 FT     공      0
2  2020      1      계  10 FT     계      0

In [6]:
# dataframe information check 

print(df3.info())
print('\n',df3.dtypes,'\n')
df3.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 432 entries, 0 to 431
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    432 non-null    int64
 1   month   432 non-null    int64
 2   vessel  432 non-null    object
 3   FT      432 non-null    object
 4   class   432 non-null    object
 5   value   432 non-null    int64
dtypes: int64(3), object(3)
memory usage: 20.4+ KB
None

 year       int64
month      int64
vessel    object
FT        object
class     object
value      int64
dtype: object

   year  month vessel     FT class  value
0  2019      1      계  10 FT     적      0
1  2019      1      계  10 FT     공      0
2  2019      1      계  10 FT     계      0

In [7]:
# groupby FT, class. check sum distribution 

def check_sum_distribution(df):
  print(df.groupby([df['FT'],df['class']])['value'].sum())

# groupby FT, class. check avg distribution 

def check_avg_distribution(df):
  print(df.groupby([df['FT'],df['class']])['value'].mean().round(2))

In [8]:
# check distribution - df1

check_sum_distribution(df1)
print('\n-------------------\n')
check_avg_distribution(df1)

FT     class
10 FT  계             0
       공             0
       적             0
20 FT  계        362002
       공        142920
       적        219082
40 FT  계        100512
       공         43658
       적         56854
기타     계             0
       공             0
       적             0
Name: value, dtype: int64

-------------------

FT     class
10 FT  계            0.00
       공            0.00
       적            0.00
20 FT  계        17238.19
       공         6805.71
       적        10432.48
40 FT  계         4786.29
       공         2078.95
       적         2707.33
기타     계            0.00
       공            0.00
       적            0.00
Name: value, dtype: float64

In [9]:
# check distribution - df2

check_sum_distribution(df2)
print('\n-------------------\n')
check_avg_distribution(df2)

FT     class
10 FT  계             0
       공             0
       적             0
20 FT  계        715386
       공        288300
       적        427086
40 FT  계        177958
       공         77144
       적        100814
기타     계             0
       공             0
       적             0
Name: value, dtype: int64

-------------------

FT     class
10 FT  계            0.00
       공            0.00
       적            0.00
20 FT  계        19871.83
       공         8008.33
       적        11863.50
40 FT  계         4943.28
       공         2142.89
       적         2800.39
기타     계            0.00
       공            0.00
       적            0.00
Name: value, dtype: float64

In [10]:
# check distribution - df3

check_sum_distribution(df3)
print('\n-------------------\n')
check_avg_distribution(df3)

FT     class
10 FT  계             0
       공             0
       적             0
20 FT  계        666048
       공        248696
       적        417352
40 FT  계        184226
       공         82808
       적        101418
기타     계             0
       공             0
       적             0
Name: value, dtype: int64

-------------------

FT     class
10 FT  계            0.00
       공            0.00
       적            0.00
20 FT  계        18501.33
       공         6908.22
       적        11593.11
40 FT  계         5117.39
       공         2300.22
       적         2817.17
기타     계            0.00
       공            0.00
       적            0.00
Name: value, dtype: float64

In [11]:
# drop vessel & class - '계'

idx = df1[df1['vessel']=='계'].index
df1.drop(idx, inplace=True)
idx = df1[df1['class']=='계'].index
df1.drop(idx, inplace=True)

idx = df2[df2['vessel']=='계'].index
df2.drop(idx, inplace=True)
idx = df2[df2['class']=='계'].index
df2.drop(idx, inplace=True)

idx = df3[df3['vessel']=='계'].index
df3.drop(idx, inplace=True)
idx = df3[df3['class']=='계'].index
df3.drop(idx, inplace=True)

In [12]:
# labeling
from sklearn import preprocessing

def labeling(df, column):
  le = preprocessing.LabelEncoder()
  le = le.fit(df[column])
  df[column] = le.transform(df[column])
  print(le.classes_)
  le.inverse_transform([0,1])
  return df

In [13]:
labeling(df1, 'class')
labeling(df1, 'vessel')

['공' '적']
['국적선' '외국선']

     year  month  vessel     FT  class  value
12   2021      1       0  10 FT      1      0
13   2021      1       0  10 FT      0      0
15   2021      1       0  20 FT      1   4659
16   2021      1       0  20 FT      0   3688
18   2021      1       0  40 FT      1   1465
..    ...    ...     ...    ...    ...    ...
244  2021      7       1  20 FT      0   7373
246  2021      7       1  40 FT      1   2603
247  2021      7       1  40 FT      0   2021
249  2021      7       1     기타      1      0
250  2021      7       1     기타      0      0

[112 rows x 6 columns]

In [14]:
labeling(df2, 'class')
labeling(df2, 'vessel')

['공' '적']
['국적선' '외국선']

     year  month  vessel     FT  class  value
12   2020      1       0  10 FT      1      0
13   2020      1       0  10 FT      0      0
15   2020      1       0  20 FT      1   4530
16   2020      1       0  20 FT      0   3006
18   2020      1       0  40 FT      1    625
..    ...    ...     ...    ...    ...    ...
424  2020     12       1  20 FT      0   6890
426  2020     12       1  40 FT      1   3312
427  2020     12       1  40 FT      0   2570
429  2020     12       1     기타      1      0
430  2020     12       1     기타      0      0

[192 rows x 6 columns]

In [15]:
labeling(df3, 'class')
labeling(df3, 'vessel')

['공' '적']
['국적선' '외국선']

     year  month  vessel     FT  class  value
12   2019      1       0  10 FT      1      0
13   2019      1       0  10 FT      0      0
15   2019      1       0  20 FT      1   5587
16   2019      1       0  20 FT      0   2890
18   2019      1       0  40 FT      1    608
..    ...    ...     ...    ...    ...    ...
424  2019     12       1  20 FT      0   6405
426  2019     12       1  40 FT      1   3370
427  2019     12       1  40 FT      0   2718
429  2019     12       1     기타      1      0
430  2019     12       1     기타      0      0

[192 rows x 6 columns]

In [16]:
# drop unit - FT

def drop_FT(df, column):
  df[column]=df[column].str.split(' ', n=2, expand=True)[0]

In [17]:
drop_FT(df1, 'FT')
drop_FT(df2, 'FT')
drop_FT(df3, 'FT')

In [18]:
# drop FT - '기타'

idx = df1[df1['FT']=='기타'].index
df1 = df1.drop(idx)

idx = df2[df2['FT']=='기타'].index
df2 = df2.drop(idx)

idx = df3[df3['FT']=='기타'].index
df3 = df3.drop(idx)

In [19]:
# check result

print(df1['FT'].unique())
print(df2['FT'].unique())
print(df3['FT'].unique())

['10' '20' '40']
['10' '20' '40']
['10' '20' '40']

In [20]:
# reset index

df1.reset_index(drop=True, inplace=True)
df2.reset_index(drop=True, inplace=True)
df3.reset_index(drop=True, inplace=True)

In [21]:
# check result
print(df1.head(2))
print('\n--------------------\n')
print(df2.head(2))
print('\n--------------------\n')
print(df3.head(2))

   year  month  vessel  FT  class  value
0  2021      1       0  10      1      0
1  2021      1       0  10      0      0

--------------------

   year  month  vessel  FT  class  value
0  2020      1       0  10      1      0
1  2020      1       0  10      0      0

--------------------

   year  month  vessel  FT  class  value
0  2019      1       0  10      1      0
1  2019      1       0  10      0      0

### Concat DF

In [22]:
# concat df
df_conc=pd.concat([df1, df2, df3], axis=0)

In [23]:
# concat check
df_conc

     year  month  vessel  FT  class  value
0    2021      1       0  10      1      0
1    2021      1       0  10      0      0
2    2021      1       0  20      1   4659
3    2021      1       0  20      0   3688
4    2021      1       0  40      1   1465
..    ...    ...     ...  ..    ...    ...
139  2019     12       1  10      0      0
140  2019     12       1  20      1  11955
141  2019     12       1  20      0   6405
142  2019     12       1  40      1   3370
143  2019     12       1  40      0   2718

[372 rows x 6 columns]

In [24]:
from sklearn.model_selection import train_test_split

X_train, X_val, y_train, y_val = train_test_split(df_conc.drop(['value'],axis=1),df_conc['value'], test_size=0.2)

In [25]:
# reset index - X_train, X_val, y_train, y_val

X_train.reset_index(drop=True, inplace=True)
X_val.reset_index(drop=True, inplace=True)
y_train.reset_index(drop=True, inplace=True)
y_val.reset_index(drop=True, inplace=True)

In [26]:
# model fitting
from sklearn.linear_model import LinearRegression

lir = LinearRegression()
lir.fit(X_train, y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [27]:
# performance measurement
from sklearn.metrics import mean_absolute_error

pred = lir.predict(X_val)
mae = mean_absolute_error(pred, y_val)

print('mae: ',round(mae,3))

mae:  3009.793

In [36]:
# final result - example test

'''
# [input data info] 1: year, 2: month, 3:vessel, 4: FT, 5:class
  * year - type int64 (ex: 2021)
  * month - type int64 (ex: 9)
  * vessel - ['국적선' '외국선'] = [0, 1]
  * FT - type object (ex: 10)
  * class - ['공' '적'] = [0, 1]

# target : value

# 연동 : predict([[ ]]) 내부에 위의 input data를 해당 규칙에 맞게 넣으면, print의 결과값을 홈페이지에 로드. (궁금한 점 있으면 한소희에게 연락하면 됩니당)
'''

pred=lir.predict([[2021, 9, 0, 40, 1]]).round(2)
print(pred)

[2967.72]